{
    "brotherData": [
        {
            "description": "Elise Dougherty is a current Junior majoring in Chemical Engineering. Since crossing during the spring of 2021 with the Tau Beta class, Elise has been actively progressing and supporting this fraternity and its three pillars. She currently serves as the Regent for Theta Tau Mu Gamma Chapter, and she also had an older sister who was a Brother of Theta Tau. Originally from Syracuse, Elise indulges in multiple hobbies. Her pastimes include ice skating, rollerblading, and binging TV shows. She is also a huge fan of Taylor Swift! ",
            "linkedin": "https://www.linkedin.com/in/elise-dougherty-551b80251/"
        },
        {
            "description": "Daniel Klein, a current Junior studying Mechanical Engineering, joined Theta Tau during Spring of 2022 with the Phi Beta class. He is from Olean, NY which is approximately 1.5 hours south from Buffalo. Upon joining Theta Tau, he served as the Vice Regent for two semesters now and has had an immense impact on the development of the Fraternity and managing the multiple committees. Outside of Theta Tau, Daniel highly enjoys playing basketball and has visited New York City before. Daniel Klein has the best little!",
            "linkedin": "https://www.linkedin.com/in/danielklein4242/"
        },
        {
            "description": "Marissa Gabbamonte is a Biomedical Engineering student hailing from Long Island, NY. Her outstanding achievements include earning the NY State Biliteracy Seal in Italian and induction into the Gamma Kappa Alpha Italian Honor Society. She has taken on several leadership roles within the Mu Gamma chapter of Theta Tau, including serving as the Corresponding Secretary for 2023, Head of BOC in Fall 2022, and as the APM for Chi Beta pledging class. After college, Marissa plans to enter the workforce and use her biomedical engineering knowledge to create innovative devices. In her free time, she indulges in hobbies such as baking, painting, and crafting, while also enjoying a diverse range of music genres such as punk rock, country, classic rock, pop, and musicals. She is also an avid sports fan, particularly of football and baseball.",
            "linkedin": "https://www.linkedin.com/in/marissaggabbamonte/"
        },
        {
            "description": "Yuanjie Xu is a current Junior in Computer Science. He joined the Fraternity in Spring of 2022 with the Phi Beta class. Within the Fraternity, he served as the Head of Construction and is currently the Fraternity’s Treasurer, where he plays an extremely important role in the dues and funding of Fraternity activities. Yuanjie is a hard working individual who always lends a hand to his fellow Brothers in need. Along with this, during Summer of 2021, he was a Data Entry Intern for Kumon where he entered classwork and homework data efficiently allowing ease of access for tutors along with assisting multiple students in order to enhance their problem-solving skills.",
            "linkedin": "https://www.linkedin.com/in/yuanjiexu/"
        },
        {
            "description": "Hao Zhu is a dedicated and ambitious Sophomore majoring in Computer Science from Staten Island, New York but born in Brooklyn. He has shown an exceptional commitment to leadership within Theta Tau, currently serving as the Scribe and Co-Head of Design, demonstrating his exceptional ability to work well in a team and help coordinate successful projects. Aside from his academic and professional endeavors, Hao has a unique and interesting personality. He sports a scar on his forehead from falling down the stairs when he was younger, which makes for an interesting conversation starter. When he's not busy with his studies or leadership roles, he enjoys camping with his friends from New York City. His passion for adventure and the great outdoors is evident in his love for camping and exploring new places.",
            "linkedin": "https://www.linkedin.com/in/hao-qin-zhu-68b4831b5/"
        },
        {
            "description": "Manvir Singh is a driven Aerospace and Mechanical Engineering student from Queens, NY. He has a strong record of leadership within his fraternity, Theta Tau, having held roles such as Assistant Pledge Marshall, Head of Design, and Head of Professional Development. Manvir is dedicated to his field of study and is particularly interested in structural engineering. After graduation, he plans to enter the workforce as a Structural Engineer at General Dynamics Electric Boat. Outside of his academic pursuits and professional goals, Manvir enjoys playing basketball, video games, and exploring. He is a polyglot and can speak four languages fluently: Punjabi, English, Hindi, and Urdu. His diverse interests and experiences make him an asset to any community he's a part of. Manvir's passion for excellence and his commitment to personal growth and development make him an inspiring and influential figure within Theta Tau and beyond.",
            "linkedin": "https://www.linkedin.com/in/manvirsingh37/"
        },
        {
            "description": "David Huang is a current Graduate Student studying Data Modeling/Warehousing and Database Administration. He completed his undergraduate studies with a Bachelors of Science in Environmental Engineering as well as a minor in Computer Science. David joined Theta Tau spring of 2020 and has created his mark through his dedication and perseverance. He served as the Pledge Marshal for the Chi Beta class during the fall of 2022 and has mentored this class toward success by leading by example.",
            "linkedin": "https://www.linkedin.com/in/davidhuang164/"
        },
        {
            "description": "Felix Bermudez is an Aerospace major from Rochester with a passion for solving complex problems. Felix has made a name for himself by taking on important leadership roles within his organization such as servingas Regent for the fall of 2021. He is committed to ensuring that his team works efficiently to achieve their goals. After graduation, Felix plans to join the workforce to gain hands-on experience in the aerospace field. However, he is also considering pursuing a graduate degree later in his career. In his free time, Felix enjoys hiking, traveling, gaming, sports entertainment, and hitting the gym to stay in shape. One fun fact about Felix: he can type at an impressive speed of 120 wpm.",
            "linkedin": "https://www.linkedin.com/in/felix-bermudez-bb47281a4/"
        },
        {
            "description": "David Zaretsky is a driven and goal-oriented senior studying Biomedical Engineering at the University at Buffalo. Growing up in a deaf household with a single father, David's interest in biotechnology was sparked by his father's encouragement to explore advancements in the field. During his freshman year, David participated in an apprenticeship for tattooing, demonstrating his willingness to explore unconventional paths. Additionally, David is involved in research with the dental school, showcasing his passion for applying his knowledge to real-world problems. He is also interested in environmental issues and has actively pursued ways to make a positive impact. In his time at the university, David has held leadership roles such as Regent during the fall of 2022 and Pledge Marshal during the spring of 2022, demonstrating his ability to lead and inspire others.",
            "linkedin": "https://www.linkedin.com/in/davidczaretsky/"
        },
        {
            "description": "Billy Grippi is a Civil Engineering junior from Orangeburg, New York. He has an impressive list of achievements, from being an Honors College student to being on various successful competition teams. One team placed 14th in the country for a concrete canoe in 2022, and another that is projected to place in the top ten at the seismic design competition in 2023. He has also taken on various leadership roles: serving as the Community Service Head from fall 2021 to spring 2022, the APM in spring 2022, the Fundraising Head in fall 2022, and the Brotherhood Head in spring 2023. In his free time, Billy enjoys water sports such as swimming, rowing, and boating, as well as watching sitcoms and listening to rock music. He is also a lifeguard and swim instructor and is currently in the process of applying for dual citizenship in Italy. After graduating, Billy plans to backpack through Europe before attending graduate school for structural engineering. He aims to gain further knowledge in the field before joining the workforce. His love for water sports and rock music is evident in his free time activities while his passion for travel shows in his plan to explore Europe. With his experience in leadership roles and engineering competitions, along with his diverse interests and achievements, Billy is sure to make a valuable contribution to his future career.",
            "linkedin": "https://www.linkedin.com/in/billy-grippi-1a3064138/"
        },
        {
            "description": "Max Gustin is a current Junior in Electrical Engineering. He joined Theta Tau during the spring of 2021 with the Tau Beta class. Max is extremely hard working and values getting involved in university, currently being in the Thunder of the East Marching Band and the National Society of Professional Engineers. However, this is not where his achievements stop. During the summer of 2022, he was an Electrical Engineering Intern for Moog Inc. Currently, Max is a Student Leader for the Freshman Engineering Course, where he mentors freshman students to assist them in adjusting to college. In his free time, Max enjoys listening to classic rock, especially the Beatles. He is also a fan of the Packers football team, the number 12 being one of his favorite numbers because of Aaron Rogers, the quarterback of said football team. He also loves his two dogs from back home, Jeanette and Tobey; A black lab and cockapoo respectively.",
            "linkedin": "https://www.linkedin.com/in/max-gustin/"
        },
        {
            "description": "Delbert Hart, or Del, is an Aerospace Engineering junior with a Robotics minor at the University at Buffalo. He aims to always exceed expectations, and provide the highest degree of accomplishment in all his work. He has achieved Dean's List for two semesters consecutively, maintaining a GPA of over 3.6. Del also works as a Tinkering Assistant at the university's Tinkering Lab, which he uses to further his engineering skills while also helping others learn. As a Tinkering Assistant, Del encourages students to learn fundamental skills such as reverse engineering, CAD, Arduinos, 3D printing, and more through workshops. He also teaches them how to maintain the workspace and equipment within the lab. Furthermore, Delbert is very excited to be accepted for a summer internship with Moog Inc., where he will gain valuable industry experience. ",
            "linkedin": "https://www.linkedin.com/in/delberthart/"
        },
        {
            "description": "Matthew Amato is a driven Junior studying Biomedical Engineering at the University at Buffalo Honors College, seeking to expand his knowledge and gain practical experience in the field. With a strong passion for cell culture and tissue engineering, he is actively seeking an internship opportunity during the summer of 2023 to further develop his skills and knowledge. Matthew thrives in a laboratory environment, where he can don his coat and gloves to observe cells through a microscope. In addition to his academic pursuits, Matthew works as a Front End Assistant at Costco Wholesale, where he has honed his interpersonal and communication skills. He has achieved one of the highest member upgrades at his location, a testament to his ability to problem-solve and work collaboratively as part of a team. With his dedication to his studies and his valuable skill set, Matthew is poised to excel in his future endeavors.",
            "linkedin": "https://www.linkedin.com/in/mattcamato/"
        },
        {
            "description": "Dennis Cetaj is a current Junior in the Civil Engineering major. He crossed during Spring 2021 with the Tau Beta class. Currently, he works professionally in the construction field and works as an assistant in the Machine Shop lab. Dennis is extremely athletic, being in Track and Field in high school and enjoys going outside often. He is also of Albanian descent.",
            "linkedin": "https://www.linkedin.com/in/dennis-cetaj-ab61a8210/"
        },
        {
            "description": "Kelly Chan is a Computer Science major hailing from St. Petersburg, Florida. Kelly has taken on significant leadership roles within the organization. In Spring 2023, she will serve as the Co-Head of BOC, demonstrating her dedication to the organization and her leadership abilities.After graduation, Kelly has plans to enter the workforce as an Incoming Software Engineering Analyst at Goldman Sachs. With her passion for computer science, Kelly is excited to start her career and contribute to the development of innovative software solution. In her free time, she enjoys playing mini-games such as arcades and pool, and listening to classical music while studying. She also likes to play chess to destress and to pass time, and her favorite subject in Computer Science is web applications, which has her debating whether or not to do frontend full-time.",
            "linkedin": "https://www.linkedin.com/in/kellyjychan/"
        },
        {
            "description": "Edward Masalimov, originally from Brooklyn, NY, is pursuing a degree in Electrical Engineering. He has been actively involved in the Theta Tau fraternity, serving as Head of Professional Development, Head of Bylaws, and Head of Fundraising. Through these positions, he has demonstrated strong leadership skills and a dedication to the success of the organization. Aside from his passion for engineering, Edward is an avid fan of water parks and has visited numerous ones. He enjoys the rush of adrenaline and the joy of cooling off on a hot day. Edward's fun-loving personality and commitment to his goals make him a valuable member of the Theta Tau community.",
            "linkedin": "https://www.linkedin.com/in/edwardmasalimov-572a91221/"
        },
        {
            "description": "Tenzin Pema is a driven and accomplished individual with a passion for computer science and a Chinese minor. As a 2023 National Chinese Speech Contest Finalist, Tenzin has demonstrated her linguistic skills and cultural awareness. Additionally, Tenzin serves as the Co-Head of Brother Outreach Committee, exemplifying her leadership qualities and dedication to community involvement. After graduation, Tenzin hopes to secure a software engineering position and explore her interests in real estate. In her free time, Tenzin enjoys playing basketball and soccer. She is also an avid fan of Korean dramas. Despite her many achievements, Tenzin harbors a peculiar aversion to knees, which she finds uncomfortable to touch, look at, or even discuss.",
            "linkedin": "https://www.linkedin.com/in/tenzin-pema-179444222/"
        },
        {
            "description": "Chloe Tullius is a biomedical engineering student, from Amherst, NY. Her passion for biomedical engineering began in high school when she worked for Western New York Stem Hub as a student leader and as a co-teacher for the Hand in Hand Project and Prism Project. The Hand in Hand Project allowed for middle school and high school students to create 3D printed movable hands for children born without. During the Prism project she taught high functioning autistic children multiple STEM activities. For her work with the Stem hub she was awarded the International Girls Living In STEM Award in 2019. In Chloe’s free time she enjoys to go ice skating and spend time with friends. After graduation she plans to continue school to receive her masters degree in biomedical engineering. She plans to focus on prosthetics engineering and to make a difference in the community around her. ",
            "linkedin": "https://www.linkedin.com/in/chloe-tullius-bb6aaa272/"
        },
        {
            "description": "Gabe, a passionate and dedicated mechanical engineering student hailing from Orchard Park, NY, has a number of impressive accomplishments under his belt. Notably, he was the recipient of the Design Award for EAS 199. In addition to his academic achievements, Gabe is an accomplished leader within the university and Theta Tau community. He served as the Fundraising Vice Head and Head of the Brotherhood, where he displayed excellent communication skills and the ability to motivate his peers. Looking to the future, Gabe has his sights set on the automotive or renewable power industries and plans to work in Buffalo upon graduation. But there’s more to Gabe than just his professional goals. He has a passion for seltzer water and maintains a well-equipped home gym. In his free time, Gabe can be found watching the Buffalo Sabres, hanging out with friends, and giving back to the community by volunteering with Hearts for the Homeless in downtown Buffalo.",
            "linkedin": "https://www.linkedin.com/in/gabrielpthornton/"
        },
        {
            "description": "Jimmy Fattorusso is a current Senior majoring in Industrial Engineering. He crossed during Spring 2022 with the Phi Beta class. Outside of the Fraternity, he is a current Resident Advisor in the Sophomore building in Greiner Hall. He also enjoys working out and does it on a regular basis.",
            "linkedin": "https://www.linkedin.com/in/james-fattorusso-213988200/"
        },
        {
            "description": "Daniel Galdamez is a current Junior in Environmental Engineering and a member of the Honors College. He is from Long Island, specifically Suffolk Country. Daniel joined Theta Tau during Spring of 2022 with the Phi Beta class. Upon joining this Fraternity, he has shown extreme dedication and involvement, currently holding the positions of Head for the Construction Committee for two semesters and being an Assistant Pledge Marshal for the Spring 2023 Psi Beta class. Outside of his immense Fraternity involvement, his involvement in helping out the community does not stop. He currently tutors students in South Campus in the Science and Technology Entry Program (STEP) program where he assists students in the Buffalo area enter the STEM field and provide academic assistance. He is also a First-Generation student and is a current First-Generation Peer Mentor, where he assists incoming First-Generation students adjust to college.",
            "linkedin": "https://www.linkedin.com/in/dagaldam/"
        },
        {
            "description": "Jeffrey Kou is a current Junior studying Mechanical Engineering. He joined the Fraternity during Spring of 2022 with the Phi Beta class. Within school, he is heavily involved in the Society of Asian Scientist and Engineers (SASE). He is currently a member of the Design Committee, where he assists in creating material and graphics for the Fraternity. Over the summer, he will be an intern in his field of study. Jefrrey is also originally from Queens, NY and attended Aviation Career and TechnicaI Education High School studying Aeronautircs/Aviation/Aerospace Science and Technology. In his free time, he enjoys playing volleyball and basketball, being extremely athletic. He is also half Mandarin and half Cantonese.",
            "linkedin": "https://www.linkedin.com/in/jeffreykou/"
        },
        {
            "description": "Andrew Li, originally from Brooklyn, NY is a current Senior majoring in Computer Science. Crossing during the Spring of 2022 in the Phi Beta class, Andrew has been extremely involved in the Fraternity, currently being a Co-Head of the Design Committee. Outside of the Fraternity, Andrew is currently the Treasurer for the UB Ping Pong Club. As the Treasurer, he ensures that the club has funding from the Student Association along with ordering paddles and ping pong balls for the club meetings. He also enjoys food a lot, from cooking and eating it. He never misses an opportunity to go out and eat food or to cook his favorite dish.",
            "linkedin": "https://www.linkedin.com/in/andrewli8/"
        },
        {
            "description": "Victor is a graduating Civil Engineering major with a Transportation Focus from Brooklyn, NY. He has been an active member of the Theta Tau Mu Gamma chapter, holding various leadership positions including Pledge Class Scribe in Spring '22, Scribe in Fall '23, and APM in Spring '23. Victor is an integral part of the chapter, always striving to improve its operations and foster a positive and inclusive environment. In addition to his academic and extracurricular pursuits, Victor is an accomplished professional who has completed various internships and worked on multiple projects in the civil engineering industry. He is currently planning to take the FE exam and pursue a full-time position at Clark Patterson Lee, where he can apply his skills and knowledge to make a significant impact. Outside of work and academics, Victor is an avid follower of NY sports teams such as the Knicks, Yankees, and Giants, and enjoys gaming, pop music, and exploring his interests in space and cars.",
            "linkedin": "https://www.linkedin.com/in/victorlin12/"
        },
        {
            "description": "Myles Pauquette is a Sophomore studying Mechanical Engineering. He joined Theta Tau during Spring of 2022 with the Phi Beta class, and has made his mark on this Fraternity. He always made sure to look out for the Brothers and Potential New Members. His family is not foreign to Theta Tau, as his older brother was also an active Brother of Theta Tau. Myles is extremely athletic, playing 4 sports in high school and lifting weights in University. Myles is a person who always worked towards bettering himself and living his life with kindness, not dwelling on the past.",
            "linkedin": "https://www.linkedin.com"
        },
        {
            "description": "Juan Quintero is an Industrial Engineering student from Rego Park, Queens, NY. As a member of Theta Tau, Juan has served as a Diversity Head Co-ahead Committee member, where he has helped create numerous successful events such as arts and crafts collaboration with SASE, family feud with VSA, gingerbread house collaboration with cake club, and firm tours with APX, GM tour. Juan's leadership, dedication, and willingness to collaborate with others make him a valuable asset to the Theta Tau community. After graduation, Juan hopes to work in a manufacturing plant and eventually pursue his MBA. He also has a passion for travel and wants to explore different parts of the world. In his free time, Juan enjoys playing soccer and ping pong, and is interested in apparel. Juan's creativity, outgoing personality, and commitment to excellence make him a valuable addition to the UB community and a promising industrial engineer.",
            "linkedin": "https://www.linkedin.com/in/juan-daniel-quintero"
        },
        {
            "description": "Adrian Sin, originally from Brooklyn, NY is a current Sophomore studying Computer Science. Crossing in the Phi Beta class during Spring of 2022. Within the Fraternity, Adrian is a member of the Design Committee. During his first semester of his Freshman Year, he placed 3rd in the UB Hackathon for M&T bank challenge. In his free time, he enjoys being active, playing basketball with his fellow Pledge Brothers and friends.",
            "linkedin": "https://www.linkedin.com/in/adrian-sin-327948232/"
        },
        {
            "description": "Justin Siwa is a current junior undergraduate student studying Environmental Engineering. He joined Theta Tau in the spring of 2022 along with his pledge class Phi Beta. Born and raised in Buffalo, Justin enjoys spending his free time fishing, rock climbing, and weightlifting.  ",
            "linkedin": "https://www.linkedin.com/in/justin-siwa-35084b257/"
        },
        {
            "description": "Alex Yevzerov is a current Sophomore majoring in Aerospace Engineering and Mechanical Engineering. He joined Theta Tau during Spring of 2022 with the Phi Beta class. He has shown immense dedication for this Fraternity by balancing his two Engineering degree curriculums along with being an active Brother of Theta Tau. Outside of the Fraternity, he is involved in Campus Living as a Resident Advisor for the Engineering Living Learning Community in Governors Complex. As a Resident Advisor, he provides guidance with his",
            "linkedin": "https://www.linkedin.com"
        },
        {
            "description": "Zachary Clark is a civil engineering student at the University of Buffalo who is passionate about history and is seeking an engineering internship or part-time history position. He describes himself as an extremely motivated individual with a thirst for new and exciting challenges. During his time as a General Manager of a high-volume restaurant, Zachary learned valuable skills such as time management, financial management, interpersonal communication, and problem-solving. In his internships as an archival assistant and at a local tourism agency, he taught himself valuable skills such as efficient typing, effective communication, and creating informative history-based posts. Zachary served as PCP for the Chi Beta class often putting his problem-solving and interpersonal communications to use.",
            "linkedin": "https://www.linkedin.com/in/zachary-d-clark/"
        },
        {
            "description": "Lydia Cenac is a current Freshman majoring in Computer Science with a Music minor. She crossed into the Fraternity during the Fall of 2022 with the Chi Beta class and was born and raised in Brooklyn, NY. During the Summer of 2021, she was a UI/UX Designer for Content Economy Co. Additionally, she participated in America on Tech where she was a member of the Tech Flex Leaders and the UX Design Bootcamp. Her extensive achievements have proven her a valuable asset to the Fraternity. In her free time, she actively plays the Viola and is currently in the school’s Orchestra. Lydia is an all rounder, excelling in both her STEM courses and musical talents.",
            "linkedin": "https://www.linkedin.com/in/lydia-cenac-02b60b1b2/"
        },
        {
            "description": "Aryaman Ghosh is a current junior majoring in Computer Science. Aryaman, or Ary for short, is an international student from India. He joined Theta Tau during Fall of 2022, and has made his mark from there. Holding the position of Media Co-Head, he has helped bring the Fraternity’s social media to a new level. Currently, he works for the University as an ITCS Student Assistant. He has always traveled ever since he was little, visiting numerous countries and living in many different places. This has caused him to grow up in multiple different environments, leading to his success both as a student and a leader.",
            "linkedin": "https://www.linkedin.com/in/aryamanghosh/"
        },
        {
            "description": "James Henry is a dedicated Chemical Engineering student from Lakeview, NY. He has maintained his position in the Honors College throughout his time at UB and has gained valuable leadership experience as a manager at a local ice cream shop. James plans to pursue a Master's in Engineering after graduation and is excited to continue his academic and professional journey. In his free time, James is an avid gamer and enjoys playing on his PC. He is also a member of the UB rugby team and loves spending time with his friends and roommates. Despite his busy schedule, James still finds time to enjoy his favorite fast food chain, McDonald's, and has even eaten there nearly every day during one summer. James's friendly demeanor, dedication, and hard work make him a valuable member of the UB community and a promising young engineer.",
            "linkedin": "https://www.linkedin.com/in/james-henry-05b528254/"
        },
        {
            "description": "Anna Kane is a driven Mechanical Engineering major from Kings Park, New York. She is a recipient of both the New York State Pride Scholarship and the Women’s Empowerment Scholarship, which attest to her academic and leadership excellence. Anna has demonstrated her commitment to leadership through her role as Co-Head of Fundraising in the Spring of 2022. Her efforts in this role were instrumental in ensuring the success of fundraising initiatives. Her experience in this position showcases her leadership, teamwork, and communication skills. After graduation, Anna plans to enter the workforce and apply her skills and knowledge to real-world engineering challenges. As a dual citizen of the US and Ireland, she is interested in learning more about her Irish heritage and exploring different cultures. Anna also enjoys cooking, going to the beach, and attending concerts.",
            "linkedin": "https://www.linkedin.com/in/annaa-kanee/"
        },
        {
            "description": "Isabella Nguyen is currently a Sophomore majoring in Electrical Engineering. She was born and raised in Buffalo, NY and joined this Fraternity during Fall of 2022 in the Chi Beta class. Isabella, who goes by Bella with her close friends, is a hard working individual who always strives to be the best version she can. Within the Fraternity, she has had an immense impact by being the Media Co-Head and running the @ubthetatau instagram, assisting in boosting their graphics and social media activeness. Outside of the Fraternity, she is currently involved in Vietnamese Student Association and plays an active part in their activities.",
            "linkedin": "https://www.linkedin.com/in/isabellatnguyen/"
        },
        {
            "description": "Rrucha Singh is a driven individual originally from India who is currently pursuing her studies at the University at Buffalo. She is an active member of the university community, serving as an Undergraduate Teaching Assistant, a UBIT Tech Squad Consultant, and a Senior Research Aide at the Research Foundation for SUNY. As an Undergraduate Teaching Assistant, Rrucha shares her knowledge and passion for algorithmic concepts, such as graph theory, dynamic programming, and NP-completeness, with her students. She takes pride in evaluating each student's comprehension level and providing tailored feedback accordingly. Rrucha's strong work ethic and dedication to her studies and work make her a valuable asset to the University at Buffalo  and the Theta Tau community.",
            "linkedin": "https://www.linkedin.com/in/rruchasingh/"
        },
        {
            "description": "Jenny Zhu is a Sophomore majoring in Electrical Engineering from Staten Island, New York. She joined Theta Tau during Fall of 2022 with the Chi Beta class. Upon entering the Fraternity, she has shown immense effort and passion towards mentoring the incoming class and makes herself an active member of the Brotherhood. Jenny started her undergraduate career at The City College of New York as an Architecture major. She has also played the trombone for the past 9 years. Upon transferring to the University at Buffalo, she currently is employed as a Student Assistant in the Sophomore building Greiner Hall. ",
            "linkedin": "https://www.linkedin.com/in/jenny-zzn-zhu/"
        }
    ]
}